strng = """
КНМЫН ЧШАЕЦ ЯЯВЦА НКЩНФ ПЯВНД НОЦЫЛ ЦЯЛЦЯ ЛЦЫШЯ ФЦКЦФ РЧЦНЩ ШЯЦЫН ЩЬЛБЭ РЫНДН АЩЛВН ЛНЕЬШ
ЩНЧРЯ ЛШФША НФШЕН КЦЫЫЬ РЧНАД ШКНЯН ИЬРТС ШЭВШШ ЩНМЯН РМШЫШ ФШУВБ ЯЛЕНШ ЯЛКЦЧ АЩЛЯН АМЦГС
ШЧЩНФ ЫБГШФ ФГАШГ ЕРЦФП ЫНЯЛШ ЛЭВЩН ВЦАЬК ЦТЯКН ГБЯЛЦ ЫНКВБ ДНЯЛГ АЩЛБЭ РЫЬШД НКНЕШ ЛХЛНШ
УЯБМП ИЦАЩЛ ШУЧШЕ АЩЛШУ ИЬЛШР КЯРАЩ ЛЭЛНН ЫШЧНД БЛМНЯ ЛШДЫБ ЛПШЩН АЫЦЛП ЛЭВЛЦ ЧЫЦУН МТЛЯТ
ЯЩРЖШ ЦФПЫЬ РФРЫЛ ЬЯАЦЩ ШЯЦЫЫ ЬЧШЫЦ ЫШУХФ РВЛЕШ ЭРЯВШ ЧШШЧЩ БФПЯЦ ЧШНЫШ ЯННЛК РЛЯЛК БГЛЛР
ЧЯЛЦШ ФШМКБ ЧЯЛЦЧ ЧШФФШ ЦЕМЦЧ ТКФРЫ ШШАЩЛ ЯВЦВШ ЧШЧНЮ РЛЯЛН ФВЫБЛ ПЯТЭР ФНКРВ КЫЦШИ НФРРИ
НДЦЛН ШКЩРЭ ЦЛФРЫ ШТЧШЮ ШАЫШЛ ЭВРЯФ ШИКЬЩ НМЫТФ ШВЕЬЗ ВБИЦЕ ЦИЦЫЦ АЩЛЛН БКШМР ФШИЬЛ НФПВН
ИФРЯЛ ТСШРФ РЫЛЬА ШЛЩНВ ЕЬЛЬР ИРФЬЧ ШАШДА ЦДЦЧШ АШЛЯФ НКЫНЫ ЦЛРВЦ ЧШЩФР ЯРЫШЫ ЦЖРФФ БФНШМ
РАЩЛЫ НХЛНА ЫНШЫЬ РЫНЭШ ГДЦШЕ НВНЛК НФЫАЩ ЛХЛНЛ РФЦАК РЕРШШ ДЕНУН ЛЩЦФП ИБАЩЛ ХЛНЩН УНЕНЫ
ЫШЩПТ ЫВШАЩ ЛКВБЯ ТИФНВ ШДЕБЗ АЩЛЯЫ РЮЫЬР ЧРЛРФ ШАЩЛК РЭРЕЦ АЩЛЩЕ НКРМР ЫЫЬРК ЯРЧРШ ЫНЧВЕ
БДББЩ ЬФЦГС РДНВЦ ЧШЫЦА ЩЛШВЕ ШВШЫЦ ЩЦФБИ РЛНЫБ СРДНВ НЕЦИФ ТАЩЛШ ДНЕЫЬ РКРЕЗ ШЫЬАЩ ЛШВФЦ
МИШСЦ АЩЛШИ ЕРМНК ЬРДЦФ ФГЖШЫ ЦЖШШЛ ЦЧКРЯ ПЧШЕЛ ЭВ
"""
azbuk = dict()
new_string = str()
for char in strng:
    if(char == ' ' or char == '\n'):
        continue
    new_string += char
    if(char in azbuk):
        azbuk[char] += 1
    else:
        azbuk[char] = 1
for char, count in sorted(azbuk.items(), key=lambda x: x[1], reverse=True): # Вывод частоты букв
    print(f"{char} - {count}")

new_string = new_string.replace("ЛЭВ", '.').replace("АЩЛ", ',') # Замена триграм на символы
#new_string = new_string.replace('Л', 'Т').replace('В', 'К').replace('А', 'З').replace('Щ', 'П').replace('Э', 'Ч')

print(new_string, end="\n\n")
"""
trigramm = dict()
for i in range(len(new_string)-3): # Счет триграмм
    if(new_string[i:i+3] in trigramm):
        trigramm[new_string[i:i+3]] += 1
    else:
        trigramm[new_string[i:i+3]] = 1

for key, value in sorted(trigramm.items(), key=lambda x: x[1], reverse=True):
    if(value != 1 and value != 2):
        print(f"key - {key}, value - {value}")
"""
"""
key - ЛЭВ, value - 3 - ТЧК
key - АЩЛ, value - 19 - ЗПТ
    Л = Т
    В = К
    А = З
    Щ = П
    Э = Ч

    Ф = Ш
    Ц = И
    М = С
    И = Я
    С = ? (возможно, мягкий знак)
    О = Ф? или Э
"""



